{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor": {"name": "keras_tensor:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100040"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "keras_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/Cast", "op": "Cast", "input": ["keras_tensor"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/Cast", "StatefulPartitionedCall/sequential_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/Cast", "StatefulPartitionedCall/sequential_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/Less", "StatefulPartitionedCall/sequential_1/embedding_1/add", "StatefulPartitionedCall/sequential_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/sequential_1/embedding_1/SelectV2", "StatefulPartitionedCall/sequential_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/reshape_1/Shape", "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/reshape_1/strided_slice", "StatefulPartitionedCall/sequential_1/reshape_1/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/GatherV2", "StatefulPartitionedCall/sequential_1/reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/reshape_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/embedding_1/GatherV2/ReadVariableOp", "shape": [100040, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}]}]}